## 23 Feb_ AssQ
 ## Pandas Basic
 
### Q1 Create a pandas series that contains the following data : 4,8,15,16,23 and 42 then, print the series.

In [2]:
import pandas as pd

vr1 = pd.Series([4,8,15,16,23,42])
vr1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## 2 Create a variable of list type containing 10 element in it and apply Pandas Series function on the variable print it.

In [4]:
nlist=['v','r','y','t','p',3,5,9,7,2]
vr2 = pd.Series(nlist)
vr2

0    v
1    r
2    y
3    t
4    p
5    3
6    5
7    9
8    7
9    2
dtype: object

## Q3 Create a pandas DataFrame that Contains the following data

In [6]:
vr3 = pd.DataFrame([['Alice',25,'Female'],['Bob',30,'Male'],['Charle',27,'Femal']])

vr3

        0   1       2
0   Alice  25  Female
1     Bob  30    Male
2  Charle  27   Femal

## Q4. What is "DataFrame" in Pandas and how is it differnet from pandas Series? Explain with an example ?


* Pandas dataframe is a widely used data structure which works with a Two-dimensional array with labeeled axes (rows and Columns)

* DataFrame is defined as a standard way to store data that has two diffent indexes. row indes and column index.


Series is defined as a One-Dimensional array that is capable of storing various data types. the Row labels of series are called the index. We can easily convert the list, tuple and dictionary into seris using "series Method"

In [9]:
import pandas as pd

# Series 
pd.Series([1,2,3,4,5,6])

# Data Fram
pd.DataFrame([[2,4,6],[10,20,30],['a','b','r']])

    0   1   2
0   2   4   6
1  10  20  30
2   a   b   r

## Q5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [10]:
d1 = pd.DataFrame([[2,4,6],[10,20,30],['A','B','C']])

d1

    0   1   2
0   2   4   6
1  10  20  30
2   A   B   C

In [11]:
# Rename - Column and Index

d1.index= ['one','two','three']
d1.columns=['price','age','value']
d1

      price age value
one       2   4     6
two      10  20    30
three     A   B     C

In [12]:
# Print First 2 dataset

d1.head(2)

    price age value
one     2   4     6
two    10  20    30

In [13]:
# pritn Last 2 Dataset

d1.tail(2)

      price age value
two      10  20    30
three     A   B     C

## Q7. Create a DataFrame using multiple Series . Explain with an Example

In [14]:
import pandas as pd

s1  = pd.Series(['8 cups', '9 cups', '3 large', '7 can'])
s2  = pd.Series(['Flour', 'Milk', 'Eggs', 'Spam'])
print(type(s1), type(s2))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [15]:
pd.DataFrame([s2,s1])

        0       1        2      3
0   Flour    Milk     Eggs   Spam
1  8 cups  9 cups  3 large  7 can